Revit 2017 API
TextNode.GetFormattedTextRuns Method
 Returns a list of separated runs of formatted text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Use GetFormattedText() instead.")]
public IList<FormattedTextRun> GetFormattedTextRuns()
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Use GetFormattedText() instead.")> _
Public Function GetFormattedTextRuns As IList(Of FormattedTextRun)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Use GetFormattedText() instead.")]
public:
IList<FormattedTextRun^>^ GetFormattedTextRuns()
Return Value
 A collection of instances of FormattedTextRun.
Remarks
 This method is obsolete and may return an empty array for certain nodes. Use GetFormattedText() instead.
See Also
TextNode Class
Autodesk.Revit.DB Namespace